#+TITLE: Chemical Engineering Departments on ResearchGate
#+BEGIN_HTML
<%inherit file="_templates/site.mako" />
#+END_HTML

#+BEGIN_HTML
<script type="text/javascript">
    (function() {
        var st = document.createElement('script');
        st.type = 'text/javascript';
        st.async = true;
        st.src = 'https://www.researchgate.net/javascript/plugin/plugin-api-min.js';
        var s = document.getElementsByTagName('script')[0];
        s.parentNode.insertBefore(st, s);
    })();
</script>
#+END_HTML

* build					:noexport:
#+BEGIN_SRC emacs-lisp
(org-html-export-to-html nil nil nil t nil)
(rename-file "research-gate.html" "research-gate.html.mako" t)
#+END_SRC

#+RESULTS:



#+name: rg-scores
| Name         | RG Score | # publications |
|--------------+----------+----------------|
| Caltech      |     4242 |           2896 |
| MIT          |     4189 |           3839 |
| GA Tech      |     2874 |           1122 |
| Minnesota    |     2154 |           1204 |
| Stanford     |     2081 |           1683 |
| UC Boulder   |     1832 |           1000 |
| Delaware     |     1683 |           1020 |
| UC Berkeley  |     1681 |            264 |
| Michigan     |     1568 |           1703 |
| UT Austin    |     1565 |           2863 |
| NC State     |     1427 |            591 |
| Princeton    |     1358 |           1806 |
| Purdue       |     1298 |           1067 |
| Hopkins      |     1232 |            592 |
| Northwestern |     1221 |           1435 |
| UCSB         |     1199 |           1809 |
| UW Madison   |     1197 |           1890 |
| Illinois     |     1083 |            663 |
| Cornell      |      900 |            548 |
| CMU          |      885 |           1685 |
| UPenn        |      778 |            316 |

#+BEGIN_SRC python :results output org drawer :var data=rg-scores
import matplotlib.pyplot as plt
import numpy as np

labels = [x[0] for x in data]
rg = [x[1] for x in data]

plt.figure(figsize=(4, 6))
ind = np.arange(len(labels))
width = 0.4
plt.bar(ind, rg, width)
plt.xticks(ind + width/2., labels, rotation='vertical', fontsize=10)
plt.ylabel('RG Score')
plt.xlim(min(ind) - width, max(ind) + 2 * width)
plt.tight_layout()

plt.savefig('/Users/jkitchin/Desktop/rg-scores.png', dpi=300)

#plt.plot(labels, rg)
#+END_SRC

#+RESULTS:
:RESULTS:
:END:

